nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CMC0</name>
      <description>Core Mode Controller</description>
      <groupName>CMC</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x124</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMC0</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3020000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKCTRL</name>
          <description>Clock Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>Clocking Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CKMODE0000</name>
                  <description>Core clock is on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0001</name>
                  <description>Core clock is off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0011</name>
                  <description>Core and platform clocks are off</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0111</name>
                  <description>Core, platform, and peripheral clocks are off, but no change in Low-Power mode</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE1111</name>
                  <description>Core, platform, and peripheral clocks are off, and core enters Low-Power mode</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Blocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CKSTAT</name>
          <description>Clock Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>Low Power Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CKMODE0000</name>
                  <description>Core clock is on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0001</name>
                  <description>Core clock is off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0011</name>
                  <description>Core and platform clocks are off</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE0111</name>
                  <description>Core, platform, and peripheral clocks are off, but no change in Low-Power mode</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CKMODE1111</name>
                  <description>Core, platform, and peripheral clocks are off, and core enters Low-Power mode</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake-up Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Clock Status Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Core clock not gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Core clock was gated due to Low-Power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMPROT</name>
          <description>Power Mode Protection</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Low-Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN1</name>
                  <description>Allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN2</name>
                  <description>Allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN3</name>
                  <description>Allowed</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN4</name>
                  <description>Allowed</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN5</name>
                  <description>Allowed</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN6</name>
                  <description>Allowed</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN7</name>
                  <description>Allowed</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN8</name>
                  <description>Allowed</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN9</name>
                  <description>Allowed</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN10</name>
                  <description>Allowed</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN11</name>
                  <description>Allowed</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN12</name>
                  <description>Allowed</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN13</name>
                  <description>Allowed</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN14</name>
                  <description>Allowed</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock Register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Blocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPMCTRL</name>
          <description>Global Power Mode Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Low-Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCTRLMAIN</name>
          <description>Power Mode Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Low-Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMODE0000</name>
                  <description>Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0001</name>
                  <description>Sleep</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0011</name>
                  <description>Deep Sleep</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0111</name>
                  <description>Power Down</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE1111</name>
                  <description>Deep-Power Down</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCTRLWAKE</name>
          <description>Power Mode Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Low-Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMODE0000</name>
                  <description>Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0001</name>
                  <description>Sleep</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0011</name>
                  <description>Deep Sleep</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE0111</name>
                  <description>Power Down</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE1111</name>
                  <description>Deep-Power Down</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
